const http = require('http') // імпортуєм модуль http

//тут порт вносим в окрему змінну і будем отримувати його із змінних оточення 
const PORT = process.env.PORT || 5000 // якщо переміння оточення не задана то за замовчуванням PORT буде 5000 

//методом createServer створюєм сервер 
// за допомогою req,res за допомогою якого ми будем обробляти вхідні запити і повертати користувачу відповіді
const server = http.createServer((req,res)=>{// тут будем працювати із стрімами req,res (запит і відповідь)
    //щоб сервер повертав нам текст у браузері вказуєм ось це значення  res.writeHead
    res.writeHead(200,{ // тут вказуєм статус коду 200 
        'Content-type':'text/html;charset=utf-8'// тут вказуєм текст типу штмл та вказуєм кодировку utf-8
    })
     //тут ми можем користувачу отправляти гупертекстову розмітку штмл (сервер-сайт-рендерінг - коли ми штмл генеруєм на сервері і отправляєм нову розмітку на клієнт )
    res.end('<h1>Hello World<h1><button>Кнопка</button>')// тут закриваєм стрім і передаєм дані для того щоб користувач отримав відповідь від серверана його запит 
    //щоб правки застосувались необхідно перезапустить сервер , але щоб кожний раз не перезапускати сервер у package.json ставим "start": "nodemon index.js" (на кожну зміну коду буде автоматично перезапускатись сервер)
})
//для того щоб сервер слухав вхідні запити необхідно визвати функцію listen і першим аргументом передати PORT 
server.listen(PORT, ()=>console.log(`Server started on PORT ${PORT}`))// другим аргументом передаєм callback який відпрацює в тому випадку якщо сервер запустився успішно (в логах виведем запис про старт в конкретному порту)