console.log(process.pid) 
//process - це глобальний обєкт за допомогою якого ми можемо отримати інформацію про поточний процес 
//(наприклад можемо подивитись під яким номером поточний процес)(при кожному запуску цифра змінюється)
//якщо запустити якийсь нескінченний цикл то він буде крутитись у node js програмі у диспетчері задач (щоб зупинити процес необхідно ввести у новий термінал kill і номер відповідного процесса)

//змінні оточення що доступні у полі env у обєкта process
console.log(process.env.PORT)//змінні які ми можем створювати самі (змінна PORT) - цю перемінну ми не проініціювали
console.log(process.env.NODE_ENV)//змінні які ми можем створювати самі (змінна NODE_ENV) - цю перемінну ми не проініціювали
//Для того щоб при запуску передавати якісь змінні оточення необхідно встановити спеціальний пакет який називається cross-env (вводим в термінал npm i cross-env)

//Щоб ці перемінні проініціювати необхідно у package.json у полі "scripts": зробити поле "start" і у виконанній команді при запускі scripts пропишем "cross-env PORT=5000 NODE_ENV=production node ./lessons/process.js"
//щоб цю змінну запустити вводим у термінал npm та назву поля (start)
//Щоб проініціалізувати змінну оточення ми  перд виконуючою командою пишем cross-env ("cross-env PORT=5000 NODE_ENV=production node ./lessons/process.js") 
//Обовязково вказуєм чому рівняється наша змінна (PORT=5000 та NODE_ENV=production)
//І тепер при запуску у терміналі (прописуєм npm start) цих змінних буде вказуватись на що рівняються змінні 