// Файлова система

//Для взаємодії з файловою системою є модуль fs та робота із шляхом path
const fs = require('fs')
const path = require('path')

const text = process.env.Text || '';// тут отримуєм змінну оточення (TEXT) , якщо змінна не вказана то проініціюєм її пустим рядком

writeFileAsync(path.resolve(__dirname,'text.txt'),text)//створюєм файл та вказуєм шлях і передаєм сюди те що отримали із змінної оточення (text)
     .then(()=> readFileAsync(path.resolve(__dirname,'text.txt')))//тут вказуєм шлях файлу (читаєм сам файл)
     .then(data => data.split(' ').length)// тутрахуєм кількість слів у цьому файлі (визиваєм функцію split і в якості роздільника вказуєм пробіл і отримуєм масив length після виконання цієї функції де буде вказано кількість слів)
     //отриманий результат необхідно записати у новий файл
     //тут використовуєм знову функцію writeFileAsync де використаєм новий шлях із новим файлом ('count.txt') куди ми запишим кількість слів які порахували 
     .then(count => writeFileAsync(path.resolve(__dirname,'count.txt'),`кількість слів які ми порахували ${count}`))

     //в терміналі передаєм змінну оточення TEXT і в неї напишим той текст який нам потрібен і вказуєм шлях до нашого файлу 
     // ось так буде виглядати запис у терміналі - cross-env TEXT="1 2 3 4 5 6 dhdfn" node .\lessons\file-system8.js  
     // після чого має зявитись два файла (в одному текст який прописуєм у терміналі , а у іншому кількість слів які ми рахували)