const os = require('os') // імпортуєм модуль os (операційна система)

console.log(os.platform()) //функція platform дозволяє отримати нам поточну операційну ситстему (показує характеристику вінди)
console.log(os.arch())//функція arch повертає нам архітектуру процесора
console.log(os.cpus().length) // функція cpus повертає масив де кожний обєкт цього масиву це опис ядра процесора

const cpus = os.cpus()

//в циклі можем запускати в залежності від кількості ядер різну кількість процесів js програми щоб рівномірно передавати навантаження
// в циклі проходим по кількості ядер , отримуєм необхідне ядро , запускаєм процес 
for (let i = 0;i<cpus.length - 2;i++) { // cpus.length - 2 - тут залишаєм 2 ядра вільних від навантаження щоб вони були зайняті операційною системою 
    const CPUcore = cpus[1]
    console.log('Запустити ще один node.js процес')
}

console.log(process.pid)

while (true) {// тут робим нескінченний цикл щоб програма не завершувалась

}
// в диспетчері задач по id цього процесу буде показаний node.js процес