//Щоб прочитати файл .env необхідно встановити пакет dotenv (пишем в терміналі npm i dotenv)
// У файлі .env ми вписуємо змінні щоб не прописувати їх у package.json для більш читаємості коду

const dotenv = require('dotenv') // за допомогою функції require (аргумент в ній ми вкзуєм назву пакету який хочем імпортувати) ми імпортуємо пакет який хочемо використовувати (у нашому випадку пакет dotenv )
dotenv.config() // у пакета який ми імпортували визиваєм функцію config

console.log(process.env.PORT)
console.log(process.env.NODE_ENV)

// у обєкта process є так звані аргументи (argv) які ми можем при запуску програми вказувати 
console.log(process.argv) // таким чином ми можемо передавати уже на старті програми якісь відповідні команди , і в залежності від цих команд визначати певну логіку

//Залежно від певних умов можливо завершити певний процес 
if(Math.random() > 0.5) {
    while (true) {// тут ставим умову при якій буде крутитися безкінченно програма

    }
} else {// тут виведем в логи сповіщення про закінчення дії 
    console.log('Виконання програми закінчено')
    process.exit()//у обєкта  process визвем exit
}// коли ми запустим цю дію то в одних випадках вона буде завершувати роботу , а в інших буде безкінченно крутитись (при певних умовах ми можем екстренно завершити процес)
