// Файлова система

//Для взаємодії з файловою системою є модуль fs та робота із шляхом path
const fs = require('fs')
const path = require('path')

//функція mkdir дозволяє створити папку 
fs.mkdirSync(path.resolve(__dirname, 'dir1','dir2','dir3'),{recursive:true})// тут аргументом вказуєм шлях до директорії в якій буде створена папка(path.resolve та передаєм тути __dirname із вказуванням назви папки 'dir')
//За замовчуванням node.js створювати папки неможе , тож для цього іншим аргументом необхідно передати обєкт у якого властивість recursive буде із значенням true
//таким чином ми можем створювати безкінечну кількість вложених директорій

