//модуль path який дозволяє необхідним чином взаємодіяти з шляхами (абсолютними або відносними )
//запускаєм в терміналі node .\lessons\path.js для отримання інфи через консоль

const path = require('path')

//join - дозволяє склеювати декілька участків шляху (зєюнує їх /)
//join - дозволяє склеювати шляхи незалежно від системи на якій запускається node.js програма (лінокс,віндовс,мак)
console.log('Склеює ділянку шляху',path.join('first','second','third')) //те саме що і - const fullpath = 'first/second/third'

//За допомогою __dirname  ми можем отримувати абсолютний шлях від корня до директорії в якій ми використовуєм цю глобальну змінну 
console.log('Склеює ділянку шляху',path.join(__dirname,'first','second','third'))//__dirname - рядок який утримує шлях до поточної директорії
console.log('Склеює ділянку шляху',path.join(__dirname,'..','..'))//якщо нам необхідно повернутись на один рівень вложенності в папці назад то ми використовуєм дві точки ('..') ,якщо додати ще дві точки то повернимось ще на одну папку нище

//resolve - завжди повертає абсолютний шлях
console.log('Отримати абсолютний шлях',path.resolve('first','second','third'))
console.log('Отримати абсолютний шлях',path.resolve('/first','second','third'))// якщо додати слеш до одного компоненту то асолютний шлях буде починатися від цього аргументу ('/first')

const fullpath = path.resolve('first','second','third') // тут винесем наш шлях у окрему змінну 
//тут отримаєм обєкт в якому прописано корінь , назва файлу та його розширення
console.log('Парсинг шляху', path.parse(fullpath)) // тут ми розпарсим цей рядок (через функцію parse передаєм участок шляху fullpath) 
console.log('роздільник в ОС', path.sep)
console.log('перевірка на абсолютний шлях', path.isAbsolute('first/second'))
console.log('назва файлу',path.basename(fullpath))
console.log('розширення файлу',path.extname(fullpath))

//Робота з URL
const siteURL = 'http://localhost:8080/users?id=5123'//

const url = new URL(siteURL) // тут створюєм глобально доступний клас URL та передаєм туди юрл
console.log(url)// тут отримаємо повну інформацію по юрл у терміналі


